/* RuleEditorController */
"%@ (Disabled: %@)" = "%1$@（已停用：%2$@）";

/* SettingsViewController */
"About" = "關於";

/* BookmarkViewController */
"Add Bookmark" = "新增書籤";

/* RuleEditorController */
"All rules" = "所有規則";

/* SettingsViewController */
"Allow 3rd-Party Keyboards" = "允許第三方鍵盤";

/* SecurityViewController */
"Allow hosts to access WebRTC functions." = "所有主機都可使用  WebRTC 功能";

/* SecurityViewController */
"Allow hosts to permanently store cookies and local storage databases." = "允許主機永久儲存 cookie 和本機儲存資料庫";

/* SecurityViewController */
"Allow HTTPS hosts to load page resources from non-HTTPS hosts. (Useful for RSS readers and other aggregators.)" = "允許 HTTPS 主機從非 HTTPS 主機載入頁面資源（此規則對 RSS 閱讀器和其他聚合器有用）";

/* SecurityViewController */
"Allow Persistent Cookies" = "允許持久性 cookie";

/* Tab+UIWebViewDelegate */
"Allow this page to close its tab?" = "允許此頁面關閉其分頁？";

/* Tab+Gestures */
"An error occurred downloading image %@" = "下載圖片 %@ 時發生錯誤";

/* AppDelegate */
"Authentication Required" = "要求驗證";

/* SettingsViewController */
"Auto-Complete Search Results" = "使用搜尋結果的自動完成功能";

/* URLBlockerRuleController */
"Blocked 3rd-Party Hosts" = "已阻擋第三方主機";

/* BookmarksViewController */
"Bookmarks" = "書籤";

/* CircuSitsViewController */
"Bridge Configuration" = "網橋設定";

/* DonationViewController */
"Cancel" = "取消";

/* SettingsViewController */
"Changing this option requires restarting the app." = "更改此選項需要重新啟動應用程式";

/* SettingsViewController */
"Choose how long app remembers open tabs." = "選擇程式要在多久時間內記得開啟的分頁。";

/* AppDelegate */
"Close Tab" = "關閉分頁";

/* Tab+UIWebViewDelegate */
"Confirm" = "確認";

/* SecurityViewController */
"Content Policy" = "內容政策";

/* SettingsViewController, Storage1ViewController, Storage2ViewController */
"Cookies and Local Storage" = "cookie 和本機儲存";

/* Storage1ViewController */
"Cookies and local storage data from non-whitelisted hosts will be cleared even from open tabs after not being accessed for this many minutes." = "超過間隔時間，非白名單中主機的 cookie 和本地儲存資料將被清除，同時間內未再存取的已開啟分頁亦是。";

/* Tab+Gestures */
"Copy URL" = "複製 URL";

/* AppDelegate */
"Create New Tab" = "建立新分頁";

/* SecurityViewController */
"Custom user-agent string, or blank to use the default." = "自訂使用者代理字串，或留空使用預設值";

/* HostSettings */
"Default Settings" = "預設設定";

/* RuleEditorController */
"Disable" = "停用";

/* RuleEditorController */
"Disabled: %@" = "已停用：%@";

/* BrowsingViewController */
"Done" = "已完成";

/* BookmarkViewController */
"Edit Bookmark" = "編輯書籤";

/* RuleEditorController */
"Enable" = "啟用";

/* Tab+Gestures, Tab+UIWebViewDelegate */
"Error" = "錯誤";

/* AppDelegate */
"Focus URL Field" = "指向 URL 欄位";

/* AppDelegate */
"Go Back" = "上一步";

/* AppDelegate */
"Go Forward" = "下一步";

/* SecurityViewController */
"Handle tapping on links in a non-standard way to avoid possibly opening external applications." = "以非標準方式處理連結，避免開啟外部應用程式";

/* SettingsViewController */
"HTTPS Everywhere" = "HTTPS Everywhere";

/* HTTPSEverywhereRuleController */
"HTTPS Everywhere Rules" = "HTTPS Everywhere 規則";

/* Tab+UIWebViewDelegate */
"Ignore for this host" = "忽略此主機";

/* SecurityViewController */
"Ignore TLS Errors" = "忽略 TLS 錯誤";

/* AppDelegate */
"Log In" = "登入";

/* SettingsViewController */
"Minimum version of TLS required for hosts to negotiate HTTPS connections." = "為完成 HTTPS 連線協商，此主機至少需要 TLS 版本";

/* SettingsViewController */
"Miscellaneous" = "雜項";

/* SettingsViewController */
"Mute Audio with Mute Switch" = "使用靜音切換按鈕";

/* SecurityViewController */
"No XHR/WebSocket/Video connections" = "無 XHR/WebSocket/視訊連線";

/* JAHPAuthenticatingHTTPProtocol, Tab+Gestures, Tab+UIWebViewDelegate, DonationViewController */
"OK" = "確定";

/* Tab+Gestures */
"Open" = "開啟";

/* SecurityViewController */
"Open (normal browsing mode)" = "開啟（一般瀏覽模式）";

/* Tab+Gestures */
"Open in a New Tab" = "在新分頁開啟";

/* Tab+Gestures */
"Open in Background Tab" = "在背景標籤分頁下開啟";

/* Tab+Gestures */
"Open in Safari" = "在 Safari 中開啟";

/* SecurityViewController */
"Other" = "其它";

/* AppDelegate */
"Password" = "密碼";

/* SecurityViewController */
"Privacy" = "隱私";

/* Tab */
"Pull to Refresh Page" = "拉動以重新整理頁面";

/* DonationViewController */
"Purchase Failure" = "Purchase Failure";

/* SettingsViewController */
"Rate on App Store" = "在 App Store 上為我們評價";

/* SettingsViewController */
"Report a Bug" = "回報錯誤";

/* SecurityViewController */
"Restrictions on resources loaded from web pages." = "網頁載入資源限制";

/* RuleEditorController */
"Rules in use on current page" = "目前頁面使用的規則";

/* Tab+Gestures */
"Save Image" = "儲存圖片";

/* SettingsViewController */
"Search Engine" = "搜尋引擎";

/* SettingsViewController */
"Send Do-Not-Track Header" = "發送請勿追蹤的表頭";

/* SettingsViewController */
"Settings" = "設定";

/* AppDelegate */
"Show Bookmarks" = "顯示書籤";

/* SettingsViewController */
"Stop Auto-Complete at First Dot" = "在第一個點時停止自動補完";

/* SecurityViewController */
"Strict (no JavaScript, video, etc.)" = "安全（無 JavaScript、視訊等）";

/* SettingsViewController */
"Support" = "支援我們";

/* AppDelegate */
"Switch to Tab %d" = "切換到%d分頁";

/* SettingsViewController */
"Tab Security" = "分頁安全性";

/* Tab+UIWebViewDelegate */
"TLS certificate chain verification error (self-signed certificate?)" = "TLS 憑證錬驗證出錯  (為自行簽署的憑證嗎?)";

/* Tab+UIWebViewDelegate */
"TLS handshake failed" = "TLS 握手失敗";

/* Tab+UIWebViewDelegate */
"TLS protocol error" = "TLS 協定出錯";

/* SettingsViewController */
"TLS Version" = "TLS 版本";

/* SecurityViewController */
"Universal Link Protection" = "通用連結保護";

/* AddSiteViewController */
"URL" = "URL";

/* SettingsViewController */
"URL Blocker" = "URL 攔截";

/* SecurityViewController */
"User Agent" = "使用者代理字串";

/* RuleEditorController */
"User disabled" = "使用者已停用";

/* SettingsViewController */
"Version %@" = "Version %@";

/* SecurityViewController */
"WebRTC" = "WebRTC";

/* SettingsViewController */
"When disabled, all text entered in search bar will be sent to the search engine unless it starts with \"http\"." = "當停用時，除非是以 \"http\" 開頭的文字，否則所有文字都會被傳送到搜尋引擎。";

/* DonationViewController */
"__DONATE_EXPLANATION_PARAGRAPH1__" = "Onion Browser is a free app, but it takes time and resources to develop and maintain.";

/* DonationViewController */
"__DONATE_EXPLANATION_PARAGRAPH2__" = "You can support the app by sending a small tip through an in-app purchase, below. This is a one-time, non-recurring transaction, but you can come back any time to send another. No information about your in-app purchase is collected or stored by the Onion Browser developers.";

/* DonationViewController */
"__DONATE_EXPLANATION_PARAGRAPH3__" = "You can learn about other ways to help (including Patreon, PayPal, Bitcoin, or Zcash) in the 'About' section of the 'Settings' page.";

/* DonationViewController */
"__DONATE_THANKS__" = "Thank you! Every little bit helps! Your payment of %@ helps ensure continuing development on Onion Browser and tools that make Tor easier to integrate into other iOS apps.";
